Repository: dourgulf/CatPuzzle
Catalog: CatPuzzleApp/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: and
zh_hans: 和

source: , Given
zh_hans: ，初始固定

source: %@ · pair %@ · triple %@ · set4+ %@ · attack %@ · strongLink %@
zh_hans: %1$@ · 数对 %2$@ · 三数组 %3$@ · 多数组 %4$@ · 共同排除 %5$@ · 强链 %6$@

source: %@ cats, %@ ✕
zh_hans: %1$@ 只猫，%2$@ 个 ×

source: %@ has %@ possible cells left, and the highlighted cell conflicts with every one of them. Exclude it.
zh_hans: %1$@剩余 %2$@ 个可能位置，高亮格与它们都冲突，将其标为无猫。

source: %@ has no cell left for a cat, so one of your ✕ marks must be wrong. Undo to fix it.
zh_hans: %@已无处放猫，说明某个 × 标记有误，请撤销修正。

source: %@ Region
zh_hans: %@区域

source: %lld×%lld · seed %llu
zh_hans: %1$lld×%2$lld · 种子 %3$llu

source: 1 per region
zh_hans: 每种颜色一只

source: 1 per row & column
zh_hans: 每行每列一只

source: A fresh %lldx%lld puzzle is ready for you.
zh_hans: 新的 %1$lld×%2$lld 棋盘等你挑战。

source: A logical candidate was found, but uniqueness was not certified within the budget.
zh_hans: 已找到可逻辑求解的关卡，但未能在限制内验证唯一解。

source: Actions
zh_hans: 操作

source: Activate to mark excluded.
zh_hans: 激活以标记为无猫。

source: All Levels Complete
zh_hans: 全部关卡已完成

source: Apply
zh_hans: 应用

source: Balanced
zh_hans: 均衡拼块

source: Batch result
zh_hans: 生成结果

source: blue
zh_hans: 蓝色

source: Board
zh_hans: 棋盘

source: bolt
zh_hans: 闪电

source: Boundary mutations
zh_hans: 边界调整次数

source: brown
zh_hans: 棕色

source: Cancel
zh_hans: 取消

source: cancelled
zh_hans: 已取消

source: Candidates
zh_hans: 候选关卡

source: Cat
zh_hans: 猫咪

source: Cats cannot touch
zh_hans: 猫咪不能相邻

source: Cats cannot touch, including diagonally. Exclude the highlighted cells.
zh_hans: 猫咪不能相邻，包括斜角。将高亮格子标为无猫。

source: Cats never touch
zh_hans: 猫咪不能 相邻

source: Cats never sit next to each other
zh_hans: 猫咪不能相邻

source: certification
zh_hans: 唯一解验证

source: CHALLENGE
zh_hans: 挑战模式

source: Challenge Mode
zh_hans: 挑战模式

source: Choose Screenshot
zh_hans: 选择截图

source: circle
zh_hans: 圆形

source: Cleared %@ incorrect cats and %@ incorrect marks.
zh_hans: 已清除 %1$@ 只位置错误的猫和 %2$@ 个错误标记。

source: Close
zh_hans: 关闭

source: cloud
zh_hans: 云朵

source: column %@
zh_hans: 第 %@ 列

source: Column %@ already has its cat. Exclude the highlighted cells.
zh_hans: 第 %@ 列已有猫，将高亮格子标为无猫。

source: Column %@ has only one possible cell left. Place a cat there.
zh_hans: 第 %@ 列只剩一个可能的位置，在那里放一只猫。

source: Constructive batch
zh_hans: 批量生成

source: Continue
zh_hans: 继续

source: Continue Playing
zh_hans: 继续游戏

source: Count: %lld
zh_hans: 数量：%lld

source: Debug
zh_hans: 调试

source: diamond
zh_hans: 菱形

source: Difficulty
zh_hans: 难度

source: Dominant
zh_hans: 主色区域

source: Done
zh_hans: 完成

source: Double-tap the lit cell to place a cat.
zh_hans: 双击亮起的格子放置猫咪。

source: Double-tap the right cell to place a cat.
zh_hans: 双击正确的格子放置猫咪。

source: Easy
zh_hans: 简单

source: Empty
zh_hans: 空格

source: Enter an unsigned integer seed.
zh_hans: 请输入非负整数种子。

source: Every cat has found its perfect place.
zh_hans: 每只猫咪都找到了自己的位置。

source: Every rule is satisfied.
zh_hans: 所有规则都已满足。

source: Excluded
zh_hans: 已排除

source: EXPLORE
zh_hans: 探索模式

source: Explore freely and undo moves. Cat placements only need to follow the puzzle rules.
zh_hans: 自由尝试并可撤销操作，放置猫咪只需符合游戏规则。

source: Fixed at the start of this level.
zh_hans: 本关初始固定位置。

source: Follow System
zh_hans: 跟随系统

source: Game Over
zh_hans: 游戏结束

source: Gameplay
zh_hans: 玩法

source: Generate
zh_hans: 生成

source: Generated
zh_hans: 已生成

source: Generating…
zh_hans: 正在生成…

source: Generation was cancelled.
zh_hans: 生成已取消。

source: Geometry
zh_hans: 区域布局

source: green
zh_hans: 绿色

source: Hard
zh_hans: 困难

source: heart
zh_hans: 心形

source: hexagon
zh_hans: 六边形

source: Hint
zh_hans: 提示

source: Hint preview. Use Apply or Cancel below the board.
zh_hans: 提示预览。请使用棋盘下方的应用或取消按钮。

source: Hold & drag down ↓
zh_hans: 按住向下拖动 ↓

source: Hold the first empty cell and drag down the column to mark ×.
zh_hans: 按住第一个空格，向下拖动来标记整列。

source: invalidRequest
zh_hans: 参数错误

source: Language
zh_hans: 语言

source: LEARN THE RULES
zh_hans: 学习规则

source: Level %@
zh_hans: 第 %@ 关

source: Level Complete
zh_hans: 本关完成

source: lime
zh_hans: 青柠色

source: Logical evaluations
zh_hans: 逻辑评估次数

source: Logical Hint
zh_hans: 逻辑提示

source: logicalSearch
zh_hans: 逻辑搜索

source: Mark empty cells ×
zh_hans: 在空格标记 ×

source: Mark every other empty cell in this cat’s row and column with ×.
zh_hans: 将这只猫同行和同列的其他空格标为 ×。

source: Mark the remaining empty cells around this cat with ×.
zh_hans: 将这只猫周围剩余的空格标为 ×。

source: Marks carried over
zh_hans: 已保留标记

source: Medium
zh_hans: 中等

source: Mistakes: %@ / %@
zh_hans: 错误：%1$@ / %2$@

source: moon
zh_hans: 月亮

source: NEXT LEVEL
zh_hans: 下一关

source: No candidate satisfied the requested deduction blueprint within the budget.
zh_hans: 在限制内未找到符合指定推理要求的关卡。

source: No next step can be deduced from this board.
zh_hans: 当前棋盘无法推导出下一步。

source: No puzzle board was found in that screenshot.
zh_hans: 截图中未找到棋盘。

source: No touching
zh_hans: 不能相邻

source: Not part of this tutorial step.
zh_hans: 不是当前教学步骤的操作位置。

source: Offer the tutorial again from the beginning. Any level in progress is abandoned; finished levels are kept.
zh_hans: 从头学习教程。当前未完成的关卡将被放弃，已完成关卡会保留。

source: One cat in every colored block
zh_hans: 每种颜色各有一只猫

source: One cat in every row and column
zh_hans: 每行每列各有一只猫

source: One cat per colored block
zh_hans: 每种颜色 一只猫

source: One cat per row & column
zh_hans: 每行每列 一只猫

source: One color, one cat
zh_hans: 每种颜色一只猫

source: One of %@ and %@ must hold %@'s cat. The highlighted cell conflicts with both, so it can never be a cat.
zh_hans: %3$@的猫必定在%1$@或%2$@。高亮格与两者都冲突，因此不可能有猫。

source: Open Board
zh_hans: 打开棋盘

source: orange
zh_hans: 橙色

source: Parsed board, %lld by %lld
zh_hans: 已识别棋盘，%1$lld 行 %2$lld 列

source: partition
zh_hans: 区域划分

source: Pick a screenshot of a puzzle board. Cats and ✕ marks already on it are carried over, so you can keep going where the screenshot left off.
zh_hans: 选择棋盘截图，保留已有的猫咪和 × 标记，继续游戏。

source: pink
zh_hans: 粉色

source: Play from Screenshot
zh_hans: 从截图开始游戏

source: purple
zh_hans: 紫色

source: Puzzle Lab
zh_hans: 关卡实验室

source: Puzzle solved!
zh_hans: 通关啦！

source: R%@C%@
zh_hans: 第 %1$@ 行第 %2$@ 列

source: Reading the board…
zh_hans: 正在识别棋盘…

source: red
zh_hans: 红色

source: Reset Tutorial
zh_hans: 重置教程

source: Restart
zh_hans: 重新开始

source: Restart for a fresh board.
zh_hans: 重新开始，再试一次。

source: Restart Level
zh_hans: 重玩本关

source: Restart this level?
zh_hans: 重新开始本关？

source: Restart to try again.
zh_hans: 重新开始后再试。

source: row %@
zh_hans: 第 %@ 行

source: Row %@ already has its cat. Exclude the highlighted cells.
zh_hans: 第 %@ 行已有猫，将高亮格子标为无猫。

source: Row %@ has only one possible cell left. Place a cat there.
zh_hans: 第 %@ 行只剩一个可能的位置，在那里放一只猫。

source: Row %@, Column %@, %@
zh_hans: 第 %1$@ 行，第 %2$@ 列，%3$@

source: Screenshot
zh_hans: 截图关卡

source: Seed
zh_hans: 种子

source: Seed %@: %@ — %@
zh_hans: 种子 %1$@：%2$@ — %3$@

source: Seed %@: no matching puzzle found.
zh_hans: 种子 %@：未找到符合要求的关卡。

source: Seed must be a whole non-negative number.
zh_hans: 种子必须是非负整数。

source: Settings
zh_hans: 设置

source: Show Region Icons
zh_hans: 显示区域图案

source: Size
zh_hans: 尺寸

source: Size: %lld×%lld
zh_hans: 尺寸：%1$lld×%2$lld

source: solution
zh_hans: 求解

source: Something went wrong reading that screenshot.
zh_hans: 读取截图时出错。

source: square
zh_hans: 方形

source: star
zh_hans: 星形

source: Start
zh_hans: 开始

source: Start Game
zh_hans: 开始游戏

source: Start Tutorial
zh_hans: 开始教程

source: Start with one cat. Mark its row, column, and corners, then find the rest.
zh_hans: 找到第一只猫，标记同行、同列和周围，再寻找其他猫。

source: Supported sizes are 8...10.
zh_hans: 支持的尺寸为 8 至 10。

source: Tap all four unmarked corners around this cat to mark ×.
zh_hans: 点击这只猫四个斜角处的空格来标记 ×。

source: Tap each lit empty cell to mark ×.
zh_hans: 点击每个亮起的空格来标记 ×。

source: Tap every other cell in this cat's row to mark ×.
zh_hans: 点击这只猫同行的其他格子来标记 ×。

source: Tap or drag across each ruled-out empty cell to mark ×.
zh_hans: 点击或拖过已排除的空格来标记 ×。

source: Tap to mark × · Double-tap to place a paw
zh_hans: 单击标记 × · 双击放置猫咪

source: teal
zh_hans: 蓝绿色

source: That board has more than one solution, so it cannot be played here. Check that no part of it is cut off.
zh_hans: 棋盘有多个解，无法导入。请确认截图包含完整棋盘。

source: That board has no solution, so it was probably read wrong. Try a screenshot of the full board with nothing covering it.
zh_hans: 识别出的棋盘无解，请使用无遮挡的完整棋盘截图。

source: That board is %@ × %@ but %@ colors were read from it. Screenshots taken at full brightness, with no overlay or color filter, read best.
zh_hans: 该棋盘为 %1$@×%2$@，但识别到 %3$@ 种颜色。请使用正常亮度、无遮罩或滤镜的截图。

source: That board is %@ × %@. Boards from 4 × 4 to 12 × 12 can be imported.
zh_hans: 该棋盘为 %1$@×%2$@，支持导入 4×4 至 12×12 的棋盘。

source: That board was too large to check for a single solution.
zh_hans: 棋盘过大，无法验证是否只有一个解。

source: That cat conflicts with another cat.
zh_hans: 这只猫与其他猫的位置冲突。

source: That cat is not in the solution.
zh_hans: 猫咪不在这个位置。

source: That cell is outside the board.
zh_hans: 该位置不在棋盘内。

source: That image could not be opened. Try picking the screenshot again.
zh_hans: 无法打开图片，请重新选择截图。

source: the %@ block
zh_hans: %@区域

source: The %@ block already has its cat. Exclude the highlighted cells.
zh_hans: %@区域已有猫，将高亮格子标为无猫。

source: The %@ block has only one possible cell left. Place a cat there.
zh_hans: %@区域只剩一个可能的位置，在那里放一只猫。

source: The board in that screenshot is not square — part of it may be cut off or covered.
zh_hans: 识别出的棋盘不是正方形，可能存在裁切或遮挡。

source: The cats at %@ and %@ cannot both be right. Undo to fix it.
zh_hans: %1$@和%2$@的猫不能同时成立，请撤销修正。

source: The cats in %@ are locked into %@. Exclude the highlighted cells.
zh_hans: %1$@中的猫只能位于%2$@，将高亮格子标为无猫。

source: The colors on that board did not come out as one Region per row. A screenshot taken straight from the puzzle, without anything drawn over it, reads best.
zh_hans: 识别出的颜色区域数量与棋盘不符，请使用未涂画、无遮挡的原始游戏截图。

source: This board is a one-off and is not saved to your level progress.
zh_hans: 此棋盘为单次游戏，不计入关卡进度。

source: This board is already complete — every cat is placed.
zh_hans: 棋盘已完成，所有猫咪都已就位。

source: This cell could still hold a cat. Try another empty cell.
zh_hans: 此格仍可能有猫，请尝试其他空格。

source: This hint can no longer be applied.
zh_hans: 此提示已无法应用。

source: This is the cell the tutorial is waiting for.
zh_hans: 这是当前教程需要操作的格子。

source: Three rules, one board
zh_hans: 三条规则，一个棋盘

source: TIPS
zh_hans: 提示

source: Toggle cat
zh_hans: 放置或移除猫咪

source: triangle
zh_hans: 三角形

source: Try a cat at %@: %@ would then have nowhere left for its own cat. So it cannot be a cat — exclude it.
zh_hans: 若在%1$@放猫，%2$@就无处放猫。因此此格应标为无猫。

source: Try a cat at %@: the board contradicts itself. So it cannot be a cat — exclude it.
zh_hans: 若在 %@ 放猫，棋盘就会出现矛盾，因此此格应标为无猫。

source: Tutorial
zh_hans: 新手教程

source: Unable to update this cell.
zh_hans: 无法更新此格。

source: Undo
zh_hans: 撤销

source: Wrong cat placements cost a mistake, and Undo is disabled.
zh_hans: 放错猫咪会增加错误次数，且无法撤销。

source: yellow
zh_hans: 黄色

source: You used all three rules to find every cat.
zh_hans: 你运用三条规则找到了所有猫咪。

source: Your current board and mistake count will be cleared.
zh_hans: 将清空当前棋盘和错误次数。

source: Double-tap this cell to place a cat.
zh_hans: 双击这个格子放置猫咪。
